# RevitUnableToUpadateGroups Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..RevitUnableToUpadateGroups Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to update groups for changes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RevitUnableToUpadateGroups { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RevitUnableToUpadateGroups As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RevitUnableToUpadateGroups {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace